/**
 * @mainpage
 * <b> Лабораторна робота № 7. Поліморфізм </b>
 * <br/><b>Мета роботи:</b>: отримати знання про парадигму ООП – поліморфізм; навчитися застосовувати отримані знання на практиці.  <br/>
 * <b>Індивідуальне завдання:</b>
 * Модернізувати попередню лабораторну роботу шляхом:
 * - додавання ще одного класу-спадкоємця до базового класу. Поля обрати самостійно;
 * - базовий клас зробити абстрактним. Додати абстрактні поля;
 * - розроблені класи-списки поєднуються до одного класу таким чином, щоб він міг працювати як з базовим класом, так і з його спадкоємцями.
 * При цьому серед полів класу-списку повинен бути лише один масив, що містить усі типи класів ієрархії. 
 * Оновити методи, що працюють з цим масивом <br/>
 * @author Богданов І.
 * @date 04.04.2020
 * @version 1.0
 */

#include "menu.h"
#define _CRTDBG_MAP_ALLOC 

int main()
{
	menu(); /** Функція меню. */
	if (_CrtDumpMemoryLeaks()) { /** Перевірка на виток пам'яті.*/
		std::cout << "Утечка памяти обнаружена." << "\n";
	}
	else {
		std::cout << "Утечка памяти не обнаружена." << "\n";
	}
}